NSEE/BLDC-Embarcado-C/Como/Datasheets/SAM3N-EK/SAM3N_demo_1.0/sam3n_demo/toolkits/ewarm/inc/Atmel/iosam3n.h
#define ID_SUPC   ( 0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC   ( 1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC    ( 2) /**< \brief Real Time Clock (RTC) */
#define ID_RTT    ( 3) /**< \brief Real Time Timer (RTT) */
#define ID_WDT    ( 4) /**< \brief Watchdog Timer (WDT) */
#define ID_PMC    ( 5) /**< \brief Power Management Controller (PMC) */
#define ID_EFC    ( 6) /**< \brief Enhanced Flash Controller (EFC) */
#define ID_UART0  ( 8) /**< \brief UART 0 (UART0) */
#define ID_UART1  ( 9) /**< \brief UART 1 (UART1) */
#define ID_PIOA   (11) /**< \brief Parallel I/O Controller A (PIOA) */
#define ID_PIOB   (12) /**< \brief Parallel I/O Controller B (PIOB) */
#define ID_PIOC   (13) /**< \brief Parallel I/O Controller C (PIOC) */
#define ID_USART0 (14) /**< \brief USART 0 (USART0) */
#define ID_USART1 (15) /**< \brief USART 1 (USART1) */
#define ID_TWI0   (19) /**< \brief Two Wire Interface 0 (TWI0) */
#define ID_TWI1   (20) /**< \brief Two Wire Interface 1 (TWI1) */
#define ID_SPI    (21) /**< \brief Serial Peripheral Interface (SPI) */
#define ID_TC0    (23) /**< \brief Timer/Counter 0 (TC0) */
#define ID_TC1    (24) /**< \brief Timer/Counter 1 (TC1) */
#define ID_TC2    (25) /**< \brief Timer/Counter 2 (TC2) */
#define ID_TC3    (26) /**< \brief Timer/Counter 3 (TC3) */
#define ID_TC4    (27) /**< \brief Timer/Counter 4 (TC4) */
#define ID_TC5    (28) /**< \brief Timer/Counter 5 (TC5) */
#define ID_ADC    (29) /**< \brief Analog To Digital Converter (ADC) */
#define ID_DACC   (30) /**< \brief Digital To Analog Converter (DACC) */
#define ID_PWM    (31) /**< \brief Pulse Width Modulation (PWM) */
/*@}*/

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAM3N */
/* ************************************************************************** */
/** \addtogroup SAM3N_base Peripheral Base Address Definitions */
/*@{*/

#define SPI        CAST(Spi       , 0x40008000U) /**< \brief (SPI       ) Base Address */
#define PDC_SPI    CAST(Pdc       , 0x40008100U) /**< \brief (PDC_SPI   ) Base Address */
#define TC0        CAST(Tc        , 0x40010000U) /**< \brief (TC0       ) Base Address */
#define TC1        CAST(Tc        , 0x40014000U) /**< \brief (TC1       ) Base Address */
#define TWI0       CAST(Twi       , 0x40018000U) /**< \brief (TWI0      ) Base Address */
#define PDC_TWI0   CAST(Pdc       , 0x40018100U) /**< \brief (PDC_TWI0  ) Base Address */
#define TWI1       CAST(Twi       , 0x4001C000U) /**< \brief (TWI1      ) Base Address */
#define PWM        CAST(Pwm       , 0x40020000U) /**< \brief (PWM       ) Base Address */
#define USART0     CAST(Usart     , 0x40024000U) /**< \brief (USART0    ) Base Address */
#define PDC_USART0 CAST(Pdc       , 0x40024100U) /**< \brief (PDC_USART0) Base Address */
#define USART1     CAST(Usart     , 0x40028000U) /**< \brief (USART1    ) Base Address */
#define ADC        CAST(Adc       , 0x40038000U) /**< \brief (ADC       ) Base Address */
#define PDC_ADC    CAST(Pdc       , 0x40038100U) /**< \brief (PDC_ADC   ) Base Address */
#define DACC       CAST(Dacc      , 0x4003C000U) /**< \brief (DACC      ) Base Address */
#define PDC_DACC   CAST(Pdc       , 0x4003C100U) /**< \brief (PDC_DACC  ) Base Address */
#define MATRIX     CAST(Matrix    , 0x400E0200U) /**< \brief (MATRIX    ) Base Address */
#define PMC        CAST(Pmc       , 0x400E0400U) /**< \brief (PMC       ) Base Address */
#define UART0      CAST(Uart      , 0x400E0600U) /**< \brief (UART0     ) Base Address */
#define PDC_UART0  CAST(Pdc       , 0x400E0700U) /**< \brief (PDC_UART0 ) Base Address */
#define CHIPID     CAST(Chipid    , 0x400E0740U) /**< \brief (CHIPID    ) Base Address */
#define UART1      CAST(Uart      , 0x400E0800U) /**< \brief (UART1     ) Base Address */
#define EFC        CAST(Efc       , 0x400E0A00U) /**< \brief (EFC       ) Base Address */
#define PIOA       CAST(Pio       , 0x400E0E00U) /**< \brief (PIOA      ) Base Address */
#define PIOB       CAST(Pio       , 0x400E1000U) /**< \brief (PIOB      ) Base Address */
#define PIOC       CAST(Pio       , 0x400E1200U) /**< \brief (PIOC      ) Base Address */
#define RSTC       CAST(Rstc      , 0x400E1400U) /**< \brief (RSTC      ) Base Address */
#define SUPC       CAST(Supc      , 0x400E1410U) /**< \brief (SUPC      ) Base Address */
#define RTT        CAST(Rtt       , 0x400E1430U) /**< \brief (RTT       ) Base Address */
#define WDT        CAST(Wdt       , 0x400E1450U) /**< \brief (WDT       ) Base Address */
#define RTC        CAST(Rtc       , 0x400E1460U) /**< \brief (RTC       ) Base Address */
#define GPBR       CAST(Gpbr      , 0x400E1490U) /**< \brief (GPBR      ) Base Address */
/*@}*/

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAM3N */
/* ************************************************************************** */
/** \addtogroup SAM3N_pio Peripheral Pio Definitions */
/*@{*/

#define PIO_PA0          (1u << 0) /**< \brief Pin Controlled by PA0 */
#define PIO_PA1          (1u << 1) /**< \brief Pin Controlled by PA1 */
#define PIO_PA2          (1u << 2) /**< \brief Pin Controlled by PA2 */
#define PIO_PA3          (1u << 3) /**< \brief Pin Controlled by PA3 */
#define PIO_PA4          (1u << 4) /**< \brief Pin Controlled by PA4 */
#define PIO_PA5          (1u << 5) /**< \brief Pin Controlled by PA5 */
#define PIO_PA6          (1u << 6) /**< \brief Pin Controlled by PA6 */
#define PIO_PA7          (1u << 7) /**< \brief Pin Controlled by PA7 */
#define PIO_PA8          (1u << 8) /**< \brief Pin Controlled by PA8 */
#define PIO_PA9          (1u << 9) /**< \brief Pin Controlled by PA9 */
#define PIO_PA10         (1u << 10) /**< \brief Pin Controlled by PA10 */
#define PIO_PA11         (1u << 11) /**< \brief Pin Controlled by PA11 */
#define PIO_PA12         (1u << 12) /**< \brief Pin Controlled by PA12 */
#define PIO_PA13         (1u << 13) /**< \brief Pin Controlled by PA13 */
#define PIO_PA14         (1u << 14) /**< \brief Pin Controlled by PA14 */
#define PIO_PA15         (1u << 15) /**< \brief Pin Controlled by PA15 */
#define PIO_PA16         (1u << 16) /**< \brief Pin Controlled by PA16 */
#define PIO_PA17         (1u << 17) /**< \brief Pin Controlled by PA17 */
#define PIO_PA18         (1u << 18) /**< \brief Pin Controlled by PA18 */
#define PIO_PA19         (1u << 19) /**< \brief Pin Controlled by PA19 */
#define PIO_PA20         (1u << 20) /**< \brief Pin Controlled by PA20 */
#define PIO_PA21         (1u << 21) /**< \brief Pin Controlled by PA21 */
#define PIO_PA22         (1u << 22) /**< \brief Pin Controlled by PA22 */
#define PIO_PA23         (1u << 23) /**< \brief Pin Controlled by PA23 */
#define PIO_PA24         (1u << 24) /**< \brief Pin Controlled by PA24 */
#define PIO_PA25         (1u << 25) /**< \brief Pin Controlled by PA25 */
#define PIO_PA26         (1u << 26) /**< \brief Pin Controlled by PA26 */
#define PIO_PA27         (1u << 27) /**< \brief Pin Controlled by PA27 */
#define PIO_PA28         (1u << 28) /**< \brief Pin Controlled by PA28 */
#define PIO_PA29         (1u << 29) /**< \brief Pin Controlled by PA29 */
#define PIO_PA30         (1u << 30) /**< \brief Pin Controlled by PA30 */
#define PIO_PA31         (1u << 31) /**< \brief Pin Controlled by PA31 */
#define PIO_PB0          (1u << 0) /**< \brief Pin Controlled by PB0 */
#define PIO_PB1          (1u << 1) /**< \brief Pin Controlled by PB1 */
#define PIO_PB2          (1u << 2) /**< \brief Pin Controlled by PB2 */
#define PIO_PB3          (1u << 3) /**< \brief Pin Controlled by PB3 */
#define PIO_PB4          (1u << 4) /**< \brief Pin Controlled by PB4 */
#define PIO_PB5          (1u << 5) /**< \brief Pin Controlled by PB5 */
#define PIO_PB6          (1u << 6) /**< \brief Pin Controlled by PB6 */
#define PIO_PB7          (1u << 7) /**< \brief Pin Controlled by PB7 */
#define PIO_PB8          (1u << 8) /**< \brief Pin Controlled by PB8 */
#define PIO_PB9          (1u << 9) /**< \brief Pin Controlled by PB9 */
#define PIO_PB10         (1u << 10) /**< \brief Pin Controlled by PB10 */
#define PIO_PB11         (1u << 11) /**< \brief Pin Controlled by PB11 */
#define PIO_PB12         (1u << 12) /**< \brief Pin Controlled by PB12 */
#define PIO_PB13         (1u << 13) /**< \brief Pin Controlled by PB13 */
#define PIO_PB14         (1u << 14) /**< \brief Pin Controlled by PB14 */
#define PIO_PC0          (1u << 0) /**< \brief Pin Controlled by PC0 */
#define PIO_PC1          (1u << 1) /**< \brief Pin Controlled by PC1 */
#define PIO_PC2          (1u << 2) /**< \brief Pin Controlled by PC2 */
#define PIO_PC3          (1u << 3) /**< \brief Pin Controlled by PC3 */
#define PIO_PC4          (1u << 4) /**< \brief Pin Controlled by PC4 */
#define PIO_PC5          (1u << 5) /**< \brief Pin Controlled by PC5 */
#define PIO_PC6          (1u << 6) /**< \brief Pin Controlled by PC6 */
#define PIO_PC7          (1u << 7) /**< \brief Pin Controlled by PC7 */
#define PIO_PC8          (1u << 8) /**< \brief Pin Controlled by PC8 */
#define PIO_PC9          (1u << 9) /**< \brief Pin Controlled by PC9 */
#define PIO_PC10         (1u << 10) /**< \brief Pin Controlled by PC10 */
#define PIO_PC11         (1u << 11) /**< \brief Pin Controlled by PC11 */
#define PIO_PC12         (1u << 12) /**< \brief Pin Controlled by PC12 */
#define PIO_PC13         (1u << 13) /**< \brief Pin Controlled by PC13 */
#define PIO_PC14         (1u << 14) /**< \brief Pin Controlled by PC14 */
#define PIO_PC15         (1u << 15) /**< \brief Pin Controlled by PC15 */
#define PIO_PC16         (1u << 16) /**< \brief Pin Controlled by PC16 */
#define PIO_PC17         (1u << 17) /**< \brief Pin Controlled by PC17 */
#define PIO_PC18         (1u << 18) /**< \brief Pin Controlled by PC18 */
#define PIO_PC19         (1u << 19) /**< \brief Pin Controlled by PC19 */
#define PIO_PC20         (1u << 20) /**< \brief Pin Controlled by PC20 */
#define PIO_PC21         (1u << 21) /**< \brief Pin Controlled by PC21 */
#define PIO_PC22         (1u << 22) /**< \brief Pin Controlled by PC22 */
#define PIO_PC23         (1u << 23) /**< \brief Pin Controlled by PC23 */
#define PIO_PC24         (1u << 24) /**< \brief Pin Controlled by PC24 */
#define PIO_PC25         (1u << 25) /**< \brief Pin Controlled by PC25 */
#define PIO_PC26         (1u << 26) /**< \brief Pin Controlled by PC26 */
#define PIO_PC27         (1u << 27) /**< \brief Pin Controlled by PC27 */
#define PIO_PC28         (1u << 28) /**< \brief Pin Controlled by PC28 */
#define PIO_PC29         (1u << 29) /**< \brief Pin Controlled by PC29 */
#define PIO_PC30         (1u << 30) /**< \brief Pin Controlled by PC30 */
#define PIO_PC31         (1u << 31) /**< \brief Pin Controlled by PC31 */
/* ========== Pio definition for SPI peripheral ========== */
#define PIO_PA12A_MISO       (1u << 12)  /**< \brief Spi signal: MISO */
#define PIO_PA13A_MOSI       (1u << 13)  /**< \brief Spi signal: MOSI */
#define PIO_PA11A_NPCS0      (1u << 11)  /**< \brief Spi signal: NPCS0 */
#define PIO_PA9B_NPCS1       (1u << 9)   /**< \brief Spi signal: NPCS1 */
#define PIO_PA31A_NPCS1      (1u << 31)  /**< \brief Spi signal: NPCS1 */
#define PIO_PB14A_NPCS1      (1u << 14)  /**< \brief Spi signal: NPCS1 */
#define PIO_PC4B_NPCS1       (1u << 4)   /**< \brief Spi signal: NPCS1 */
#define PIO_PA10B_NPCS2      (1u << 10)  /**< \brief Spi signal: NPCS2 */
#define PIO_PA30B_NPCS2      (1u << 30)  /**< \brief Spi signal: NPCS2 */
#define PIO_PB2B_NPCS2       (1u << 2)   /**< \brief Spi signal: NPCS2 */
#define PIO_PC7B_NPCS2       (1u << 7)   /**< \brief Spi signal: NPCS2 */
#define PIO_PA3B_NPCS3       (1u << 3)   /**< \brief Spi signal: NPCS3 */
#define PIO_PA5B_NPCS3       (1u << 5)   /**< \brief Spi signal: NPCS3 */
#define PIO_PA22B_NPCS3      (1u << 22)  /**< \brief Spi signal: NPCS3 */
#define PIO_PA14A_SPCK       (1u << 14)  /**< \brief Spi signal: SPCK */
/* ========== Pio definition for TC0 peripheral ========== */
#define PIO_PA4B_TCLK0       (1u << 4)   /**< \brief Tc0 signal: TCLK0 */
#define PIO_PA28B_TCLK1      (1u << 28)  /**< \brief Tc0 signal: TCLK1 */
#define PIO_PA29B_TCLK2      (1u << 29)  /**< \brief Tc0 signal: TCLK2 */
#define PIO_PA0B_TIOA0       (1u << 0)   /**< \brief Tc0 signal: TIOA0 */
#define PIO_PA15B_TIOA1      (1u << 15)  /**< \brief Tc0 signal: TIOA1 */
#define PIO_PA26B_TIOA2      (1u << 26)  /**< \brief Tc0 signal: TIOA2 */
#define PIO_PA1B_TIOB0       (1u << 1)   /**< \brief Tc0 signal: TIOB0 */
#define PIO_PA16B_TIOB1      (1u << 16)  /**< \brief Tc0 signal: TIOB1 */
#define PIO_PA27B_TIOB2      (1u << 27)  /**< \brief Tc0 signal: TIOB2 */
/* ========== Pio definition for TC1 peripheral ========== */
#define PIO_PC25B_TCLK3      (1u << 25)  /**< \brief Tc1 signal: TCLK3 */
#define PIO_PC28B_TCLK4      (1u << 28)  /**< \brief Tc1 signal: TCLK4 */
#define PIO_PC31B_TCLK5      (1u << 31)  /**< \brief Tc1 signal: TCLK5 */
#define PIO_PC23B_TIOA3      (1u << 23)  /**< \brief Tc1 signal: TIOA3 */
#define PIO_PC26B_TIOA4      (1u << 26)  /**< \brief Tc1 signal: TIOA4 */
#define PIO_PC29B_TIOA5      (1u << 29)  /**< \brief Tc1 signal: TIOA5 */
#define PIO_PC24B_TIOB3      (1u << 24)  /**< \brief Tc1 signal: TIOB3 */
#define PIO_PC27B_TIOB4      (1u << 27)  /**< \brief Tc1 signal: TIOB4 */
#define PIO_PC30B_TIOB5      (1u << 30)  /**< \brief Tc1 signal: TIOB5 */
/* ========== Pio definition for TWI0 peripheral ========== */
#define PIO_PA4A_TWCK0       (1u << 4)   /**< \brief Twi0 signal: TWCK0 */
#define PIO_PA3A_TWD0        (1u << 3)   /**< \brief Twi0 signal: TWD0 */
/* ========== Pio definition for TWI1 peripheral ========== */
#define PIO_PB5A_TWCK1       (1u << 5)   /**< \brief Twi1 signal: TWCK1 */
#define PIO_PB4A_TWD1        (1u << 4)   /**< \brief Twi1 signal: TWD1 */
/* ========== Pio definition for PWM peripheral ========== */
#define PIO_PA0A_PWM0        (1u << 0)   /**< \brief Pwm signal: PWM0 */
#define PIO_PA11B_PWM0       (1u << 11)  /**< \brief Pwm signal: PWM0 */
#define PIO_PA23B_PWM0       (1u << 23)  /**< \brief Pwm signal: PWM0 */
#define PIO_PB0A_PWM0        (1u << 0)   /**< \brief Pwm signal: PWM0 */
#define PIO_PC8B_PWM0        (1u << 8)   /**< \brief Pwm signal: PWM0 */
#define PIO_PC18B_PWM0       (1u << 18)  /**< \brief Pwm signal: PWM0 */
#define PIO_PC22B_PWM0       (1u << 22)  /**< \brief Pwm signal: PWM0 */
#define PIO_PA1A_PWM1        (1u << 1)   /**< \brief Pwm signal: PWM1 */
#define PIO_PA12B_PWM1       (1u << 12)  /**< \brief Pwm signal: PWM1 */
#define PIO_PA24B_PWM1       (1u << 24)  /**< \brief Pwm signal: PWM1 */
#define PIO_PB1A_PWM1        (1u << 1)   /**< \brief Pwm signal: PWM1 */
#define PIO_PC9B_PWM1        (1u << 9)   /**< \brief Pwm signal: PWM1 */
#define PIO_PC19B_PWM1       (1u << 19)  /**< \brief Pwm signal: PWM1 */
#define PIO_PA2A_PWM2        (1u << 2)   /**< \brief Pwm signal: PWM2 */
#define PIO_PA13B_PWM2       (1u << 13)  /**< \brief Pwm signal: PWM2 */
#define PIO_PA25B_PWM2       (1u << 25)  /**< \brief Pwm signal: PWM2 */
#define PIO_PB4B_PWM2        (1u << 4)   /**< \brief Pwm signal: PWM2 */
#define PIO_PC10B_PWM2       (1u << 10)  /**< \brief Pwm signal: PWM2 */
#define PIO_PC20B_PWM2       (1u << 20)  /**< \brief Pwm signal: PWM2 */
#define PIO_PA7B_PWM3        (1u << 7)   /**< \brief Pwm signal: PWM3 */
#define PIO_PA14B_PWM3       (1u << 14)  /**< \brief Pwm signal: PWM3 */
#define PIO_PB14B_PWM3       (1u << 14)  /**< \brief Pwm signal: PWM3 */
#define PIO_PC11B_PWM3       (1u << 11)  /**< \brief Pwm signal: PWM3 */
#define PIO_PC21B_PWM3       (1u << 21)  /**< \brief Pwm signal: PWM3 */
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PA8A_CTS0        (1u << 8)   /**< \brief Usart0 signal: CTS0 */
#define PIO_PA7A_RTS0        (1u << 7)   /**< \brief Usart0 signal: RTS0 */
#define PIO_PA5A_RXD0        (1u << 5)   /**< \brief Usart0 signal: RXD0 */
#define PIO_PA2B_SCK0        (1u << 2)   /**< \brief Usart0 signal: SCK0 */
#define PIO_PA6A_TXD0        (1u << 6)   /**< \brief Usart0 signal: TXD0 */
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PA25A_CTS1       (1u << 25)  /**< \brief Usart1 signal: CTS1 */
#define PIO_PA24A_RTS1       (1u << 24)  /**< \brief Usart1 signal: RTS1 */
#define PIO_PA21A_RXD1       (1u << 21)  /**< \brief Usart1 signal: RXD1 */
#define PIO_PA23A_SCK1       (1u << 23)  /**< \brief Usart1 signal: SCK1 */
#define PIO_PA22A_TXD1       (1u << 22)  /**< \brief Usart1 signal: TXD1 */
/* ========== Pio definition for ADC peripheral ========== */
#define PIO_PA17X1_AD0       (1u << 17)  /**< \brief Adc signal: AD0 */
#define PIO_PA18X1_AD1       (1u << 18)  /**< \brief Adc signal: AD1 */
#define PIO_PC13X1_AD10      (1u << 13)  /**< \brief Adc signal: AD10 */
#define PIO_PC15X1_AD11      (1u << 15)  /**< \brief Adc signal: AD11 */
#define PIO_PC12X1_AD12      (1u << 12)  /**< \brief Adc signal: AD12 */
#define PIO_PC29X1_AD13      (1u << 29)  /**< \brief Adc signal: AD13 */
#define PIO_PC30X1_AD14      (1u << 30)  /**< \brief Adc signal: AD14 */
#define PIO_PC31X1_AD15      (1u << 31)  /**< \brief Adc signal: AD15 */
#define PIO_PA19X1_AD2_WKUP9 (1u << 19)  /**< \brief Adc signal: AD2/WKUP9 */
#define PIO_PA20X1_AD3_WKUP10 (1u << 20) /**< \brief Adc signal: AD3/WKUP10 */
#define PIO_PB0X1_AD4        (1u << 0)   /**< \brief Adc signal: AD4 */
#define PIO_PB1X1_AD5        (1u << 1)   /**< \brief Adc signal: AD5 */
#define PIO_PB2X1_AD6_WKUP12 (1u << 2)   /**< \brief Adc signal: AD6/WKUP12 */
#define PIO_PB3X1_AD7        (1u << 3)   /**< \brief Adc signal: AD7 */
#define PIO_PA21X1_AD8       (1u << 21)  /**< \brief Adc signal: AD8 */
#define PIO_PA22X1_AD9       (1u << 22)  /**< \brief Adc signal: AD9 */
#define PIO_PA8B_ADTRG       (1u << 8)   /**< \brief Adc signal: ADTRG */
/* ========== Pio definition for DACC peripheral ========== */
#define PIO_PB13X1_DAC0      (1u << 13)  /**< \brief Dacc signal: DAC0 */
/* ========== Pio definition for PMC peripheral ========== */
#define PIO_PA6B_PCK0        (1u << 6)   /**< \brief Pmc signal: PCK0 */
#define PIO_PB13B_PCK0       (1u << 13)  /**< \brief Pmc signal: PCK0 */
#define PIO_PC16B_PCK0       (1u << 16)  /**< \brief Pmc signal: PCK0 */
#define PIO_PA17B_PCK1       (1u << 17)  /**< \brief Pmc signal: PCK1 */
#define PIO_PA21B_PCK1       (1u << 21)  /**< \brief Pmc signal: PCK1 */
#define PIO_PC17B_PCK1       (1u << 17)  /**< \brief Pmc signal: PCK1 */
#define PIO_PA18B_PCK2       (1u << 18)  /**< \brief Pmc signal: PCK2 */
#define PIO_PA31B_PCK2       (1u << 31)  /**< \brief Pmc signal: PCK2 */
#define PIO_PB3B_PCK2        (1u << 3)   /**< \brief Pmc signal: PCK2 */
#define PIO_PC14B_PCK2       (1u << 14)  /**< \brief Pmc signal: PCK2 */
/* ========== Pio definition for UART0 peripheral ========== */
#define PIO_PA9A_URXD0       (1u << 9)   /**< \brief Uart0 signal: URXD0 */
#define PIO_PA10A_UTXD0      (1u << 10)  /**< \brief Uart0 signal: UTXD0 */
/* ========== Pio definition for UART1 peripheral ========== */
#define PIO_PB2A_URXD1       (1u << 2)   /**< \brief Uart1 signal: URXD1 */
#define PIO_PB3A_UTXD1       (1u << 3)   /**< \brief Uart1 signal: UTXD1 */
/*@}*/

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAM3N */
/* ************************************************************************** */

#define IFLASH_ADDR (0x00400000u) /**< Internal Flash base address */
#define IROM_ADDR   (0x00800000u) /**< Internal ROM base address */
#define IRAM_ADDR   (0x20000000u) /**< Internal RAM base address */

#if defined sam3n1
#define IFLASH_SIZE 0x10000
#define IFLASH_PAGE_SIZE              (256) /* Internal FLASH 0 Page Size: 256 bytes */
#define IFLASH_LOCK_REGION_SIZE     (16384) /* Internal FLASH 0 Lock Region Size: 16 Kbytes */
#define IFLASH_NB_OF_PAGES            (256) /* Internal FLASH 0 Number of Pages: 256 */
#define IFLASH_NB_OF_LOCK_BITS          (4) /* Internal FLASH 0 Number of Lock Bits: 4 */
#define IRAM_SIZE 0x2000
#elif defined sam3n2
#define IFLASH_SIZE 0x20000
#define IFLASH_PAGE_SIZE              (256) /* Internal FLASH 0 Page Size: 256 bytes */
#define IFLASH_LOCK_REGION_SIZE     (16384) /* Internal FLASH 0 Lock Region Size: 16 Kbytes */
#define IFLASH_NB_OF_PAGES            (512) /* Internal FLASH 0 Number of Pages: 512 */
#define IFLASH_NB_OF_LOCK_BITS          (8) /* Internal FLASH 0 Number of Lock Bits: 8 */
#define IRAM_SIZE 0x4000
#elif defined sam3n4
#define IFLASH_SIZE 0x40000
#define IFLASH_PAGE_SIZE              (256) /* Internal FLASH 0 Page Size: 256 bytes */
#define IFLASH_LOCK_REGION_SIZE     (16384) /* Internal FLASH 0 Lock Region Size: 16 Kbytes */
#define IFLASH_NB_OF_PAGES           (1024) /* Internal FLASH 0 Number of Pages: 1024 */
#define IFLASH_NB_OF_LOCK_BITS         (16) /* Internal FLASH 0 Number of Lock Bits: 16 */
#define IRAM_SIZE 0x6000
#else
  #error Library does not support the specified device.
#endif

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* IOSAM3N_H */
